conver/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-12;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    topwall
    {
        type            compressible::kqRWallFunction;
        value           uniform 1e-12;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    plate
    {
        type            zeroGradient;
    }
    wall1
    {
        type            wedge;
    }
    wall2
    {
        type            wedge;
    }
}



// ************************************************************************* //
