conver/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    dbns
    {
        flux           rusanov;
        limiter        Venkatakrishnan;
    }

    default         none;
    div(phi,k)      Gauss upwind;
    div(phi,omega) Gauss upwind;
    div(devRhoReff) Gauss linear;
    div((devRhoReff&U)) Gauss linear;

    div((muEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         none;
    laplacian(muEff,U) Gauss linear limited 0.5;
    laplacian(DkEff,k) Gauss linear limited 0.5;
    laplacian(DomegaEff,omega) Gauss linear limited 0.5;
    laplacian(alphaEff,e) Gauss linear limited 0.5;
    laplacian(alphaEff,h) Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

relaxationFactors
{
    k               0.7;
    omega        0.7;
}


// ************************************************************************* //
